controllers/QuestionBankController.php

SELECT * FROM `category`
SELECT * FROM `question_type`
SELECT * FROM `level`
---
    public function actionCreate()
    {
        $model = new QuestionBank();

        // Get all values for drop down box
        $category = ArrayHelper::map(Category::find()->all(), 'category_id', 'category_name');
        $questionType = ArrayHelper::map(QuestionType::find()->all(), 'question_type_id', 'question_type');
        $level = ArrayHelper::map(Level::find()->all(), 'level_id', 'level_name');

SELECT * FROM `question_bank` WHERE `question_bank_id`='4'
---
    protected function findModel($id)
    {
        if (($model = QuestionBank::findOne($id)) !== null) {