models/StoreImage.php

    public function upload()
    {
        if ($this->validate()) {
            $this->save();
---
INSERT INTO `store_image` (`question_bank_id`, `file_name`, `nos_question`, `file_size`) VALUES (41, 'gLhaLfVsQTVxARp6P6hGrGkM5F4i1AHp.jpg', 10, 32693)